GopalSaraf/Practicals/PSDL/include/proc/pic10f320.inc
// Register: ADRES
#define ADRES ADRES
ADRES                                    equ 001Eh

// Register: ADCON
#define ADCON ADCON
ADCON                                    equ 001Fh
// bitfield definitions
ADCON_ADON_POSN                          equ 0000h
ADCON_ADON_POSITION                      equ 0000h
ADCON_ADON_SIZE                          equ 0001h
ADCON_ADON_LENGTH                        equ 0001h
ADCON_ADON_MASK                          equ 0001h
ADCON_GO_nDONE_POSN                      equ 0001h
ADCON_GO_nDONE_POSITION                  equ 0001h
ADCON_GO_nDONE_SIZE                      equ 0001h
ADCON_GO_nDONE_LENGTH                    equ 0001h
ADCON_GO_nDONE_MASK                      equ 0002h
ADCON_CHS_POSN                           equ 0002h
ADCON_CHS_POSITION                       equ 0002h
ADCON_CHS_SIZE                           equ 0003h
ADCON_CHS_LENGTH                         equ 0003h
ADCON_CHS_MASK                           equ 001Ch
ADCON_ADCS_POSN                          equ 0005h
ADCON_ADCS_POSITION                      equ 0005h
ADCON_ADCS_SIZE                          equ 0003h
ADCON_ADCS_LENGTH                        equ 0003h
ADCON_ADCS_MASK                          equ 00E0h
ADCON_CHS0_POSN                          equ 0002h
ADCON_CHS0_POSITION                      equ 0002h
ADCON_CHS0_SIZE                          equ 0001h
ADCON_CHS0_LENGTH                        equ 0001h
ADCON_CHS0_MASK                          equ 0004h
ADCON_CHS1_POSN                          equ 0003h
ADCON_CHS1_POSITION                      equ 0003h
ADCON_CHS1_SIZE                          equ 0001h
ADCON_CHS1_LENGTH                        equ 0001h
ADCON_CHS1_MASK                          equ 0008h
ADCON_CHS2_POSN                          equ 0004h
ADCON_CHS2_POSITION                      equ 0004h
ADCON_CHS2_SIZE                          equ 0001h
ADCON_CHS2_LENGTH                        equ 0001h
ADCON_CHS2_MASK                          equ 0010h
ADCON_ADCS0_POSN                         equ 0005h
ADCON_ADCS0_POSITION                     equ 0005h
ADCON_ADCS0_SIZE                         equ 0001h
ADCON_ADCS0_LENGTH                       equ 0001h
ADCON_ADCS0_MASK                         equ 0020h
ADCON_ADCS1_POSN                         equ 0006h
ADCON_ADCS1_POSITION                     equ 0006h
ADCON_ADCS1_SIZE                         equ 0001h
ADCON_ADCS1_LENGTH                       equ 0001h
ADCON_ADCS1_MASK                         equ 0040h
ADCON_ADCS2_POSN                         equ 0007h
ADCON_ADCS2_POSITION                     equ 0007h
ADCON_ADCS2_SIZE                         equ 0001h
ADCON_ADCS2_LENGTH                       equ 0001h
ADCON_ADCS2_MASK                         equ 0080h

// Register: PMADRL
#define PMADRL PMADRL
PMADRL                                   equ 0020h
// bitfield definitions
PMADRL_PMADR_POSN                        equ 0000h
PMADRL_PMADR_POSITION                    equ 0000h
PMADRL_PMADR_SIZE                        equ 0008h
PMADRL_PMADR_LENGTH                      equ 0008h
PMADRL_PMADR_MASK                        equ 00FFh

// Register: PMADRH
#define PMADRH PMADRH
PMADRH                                   equ 0021h
// bitfield definitions
PMADRH_PMADR8_POSN                       equ 0000h
PMADRH_PMADR8_POSITION                   equ 0000h
PMADRH_PMADR8_SIZE                       equ 0001h
PMADRH_PMADR8_LENGTH                     equ 0001h
PMADRH_PMADR8_MASK                       equ 0001h

// Register: PMDATL
#define PMDATL PMDATL
PMDATL                                   equ 0022h
// bitfield definitions
PMDATL_PMDATL_POSN                       equ 0000h
PMDATL_PMDATL_POSITION                   equ 0000h
PMDATL_PMDATL_SIZE                       equ 0008h
PMDATL_PMDATL_LENGTH                     equ 0008h
PMDATL_PMDATL_MASK                       equ 00FFh

// Register: PMDATH
#define PMDATH PMDATH
PMDATH                                   equ 0023h
// bitfield definitions
PMDATH_PMDATH_POSN                       equ 0000h
PMDATH_PMDATH_POSITION                   equ 0000h
PMDATH_PMDATH_SIZE                       equ 0006h
PMDATH_PMDATH_LENGTH                     equ 0006h
PMDATH_PMDATH_MASK                       equ 003Fh

// Register: PMCON1
#define PMCON1 PMCON1
PMCON1                                   equ 0024h
// bitfield definitions
PMCON1_RD_POSN                           equ 0000h
PMCON1_RD_POSITION                       equ 0000h
PMCON1_RD_SIZE                           equ 0001h
PMCON1_RD_LENGTH                         equ 0001h
PMCON1_RD_MASK                           equ 0001h
PMCON1_WR_POSN                           equ 0001h
PMCON1_WR_POSITION                       equ 0001h
PMCON1_WR_SIZE                           equ 0001h
PMCON1_WR_LENGTH                         equ 0001h
PMCON1_WR_MASK                           equ 0002h
PMCON1_WREN_POSN                         equ 0002h
PMCON1_WREN_POSITION                     equ 0002h
PMCON1_WREN_SIZE                         equ 0001h
PMCON1_WREN_LENGTH                       equ 0001h
PMCON1_WREN_MASK                         equ 0004h
PMCON1_WRERR_POSN                        equ 0003h
PMCON1_WRERR_POSITION                    equ 0003h
PMCON1_WRERR_SIZE                        equ 0001h
PMCON1_WRERR_LENGTH                      equ 0001h
PMCON1_WRERR_MASK                        equ 0008h
PMCON1_FREE_POSN                         equ 0004h
PMCON1_FREE_POSITION                     equ 0004h
PMCON1_FREE_SIZE                         equ 0001h
PMCON1_FREE_LENGTH                       equ 0001h
PMCON1_FREE_MASK                         equ 0010h
PMCON1_LWLO_POSN                         equ 0005h
PMCON1_LWLO_POSITION                     equ 0005h
PMCON1_LWLO_SIZE                         equ 0001h
PMCON1_LWLO_LENGTH                       equ 0001h
PMCON1_LWLO_MASK                         equ 0020h
PMCON1_CFGS_POSN                         equ 0006h
PMCON1_CFGS_POSITION                     equ 0006h
PMCON1_CFGS_SIZE                         equ 0001h
PMCON1_CFGS_LENGTH                       equ 0001h
PMCON1_CFGS_MASK                         equ 0040h

// Register: PMCON2
#define PMCON2 PMCON2
PMCON2                                   equ 0025h
// bitfield definitions
PMCON2_PMCON2_POSN                       equ 0000h
PMCON2_PMCON2_POSITION                   equ 0000h
PMCON2_PMCON2_SIZE                       equ 0008h
PMCON2_PMCON2_LENGTH                     equ 0008h
PMCON2_PMCON2_MASK                       equ 00FFh

